4nzor/gyverlamp-matter/matter-bridge/sdkconfig.defaults.esp32c6
CONFIG_IDF_TARGET="esp32c6"

# ESP32-C6 Super Mini
CONFIG_BSP_BUTTONS_NUM=1
CONFIG_BSP_BUTTON_1_TYPE_GPIO=y
CONFIG_BSP_BUTTON_1_GPIO=9
CONFIG_BSP_BUTTON_1_LEVEL=0
# Status WS2812 owned by status_led (GPIO8) — do not also bind BSP LED
CONFIG_BSP_LEDS_NUM=0

# Alice provisions Wi-Fi during Matter
CONFIG_STATUS_LED_GPIO=8
CONFIG_GYVER_WIFI_SSID=""
CONFIG_GYVER_WIFI_PASSWORD=""
